package project.controller;

import org.springframework.stereotype.Component;

// TODO:
// Завести свсё так чтобы оно контроллировало DB статистики
// создать DB статистики
// Выбрать места для внедрения статистики.

// NOTE:
// А это ок, если во время подхода выполняется sql запрос к db?...


// DB:
// - кол-во дней подряд (как считать дни?)
// - кол-во подходов в неделю? день? всё время?
// - Базово: _кол-во дней подряд_ (Чтобы делать напоминания(Та самая система оповещений) как у зеленой птицы)

@Component
public class StatisticsController {

}
